<?php
include"configs.php";
include"style/verh_reg.php";
echo'<div class="bordur">О сайте<br/></div>
<div class="menu">
Наш портал - Это твоя новая вселенная, где тысячи людей общаются, знакомятся и влюбляются! Будь тут как дома, новичкам тут всегда рады!<br>
Знакомство с сайтом лучше начинать со своего личного кабинета. Походи по ссылкам, ознакомься с каждым разделом, ты уведешь как в них кипит жизнь. <br>
Остановимся на некоторых:<br></div>
<div class="menu"><b>Новости</b> - в данном разделе вы сможете узнать все последние новости сайта.</div>
<div class="menu"><b>Мое меню</b> - старайся как можно детальнее заполнить информацию о себе.</div>
<div class="menu"><b>Форум</b> - думаю, это объяснять не нужно. Имейте в виду, что за порядком в форуме следят модераторы.<br>
Сходите в Форум и почитайте, что обсуждают люди в данный момент. Если какая-то тема вас заинтересует, не стесняйся оставить в ней свой комментарий.</div>
<div class="menu"><b>Чат</b> - в чате вы сможете онлайн общаться с различнимы пользователями, от вас требуется только желание общаться.</div>
<div class="menu"><b>Сервисы</b> - собраны самые лучшие, актуальные и оригинальные сервисы для вашего пользования.</div>
<div class="menu"><b>Онлайн игры</b> - орел-решка, гадалка, морской бой, шашки и другие игры для вас!</div>
<div class="menu">И еще многое многое другое..<br>
<a href="system/rules.php">Присоединится!</a></div>';
include"style/niz.php";
?>