<?
$date = date("d.m");
$currDate = date("d F", time());
$currDate = str_replace("January","января",$currDate);
$currDate = str_replace("February","февраля",$currDate);
$currDate = str_replace("March","марта",$currDate);
$currDate = str_replace("April","апреля",$currDate);
$currDate = str_replace("May","мая",$currDate);
$currDate = str_replace("June","июня",$currDate);
$currDate = str_replace("July","июля",$currDate);
$currDate = str_replace("August","августа",$currDate);
$currDate = str_replace("September","сентября",$currDate);
$currDate = str_replace("October","октября",$currDate);
$currDate = str_replace("November","ноября",$currDate);
$currDate = str_replace("December","декабря",$currDate); 
$currDate = str_replace("01","1",$currDate);
$currDate = str_replace("02","2",$currDate);
$currDate = str_replace("03","3",$currDate);
$currDate = str_replace("04","4",$currDate);
$currDate = str_replace("05","5",$currDate);
$currDate = str_replace("06","6",$currDate);
$currDate = str_replace("07","7",$currDate);
$currDate = str_replace("08","8",$currDate);
$currDate = str_replace("09","9",$currDate);



if($date=="01.01") { echo"C Новым годом!<br/>";}
if($date=="03.01") { echo"Лунный новый год в Литве!<br/>";}
if($date=="06.01") { echo"Йоль - праздник середины зимы в Великобритании!<br/>";}
if($date=="07.01") { echo"C Рождествов Христовым!<br/>";}
if($date=="11.01") { echo"День заповедников России!<br/>";}
if($date=="12.01") { echo"День работников прокуратуры России<br/>";}
if($date=="13.01") { echo"Cо Старым Новым годом!<br/>";}
if($date=="16.01") { echo"День Мартина Лютера Кинга в США!<br/>";}
if($date=="19.01") { echo"День супруга в Великобритании!<br/>";}
if($date=="21.01") { echo"C День инженерных войс России!<br/>";}
if($date=="22.01") { echo"День дедушки в Польше!<br/>";}
if($date=="25.01") { echo"День студентов/День штурмана ВМФ  России!<br/>";}
if($date=="26.01") { echo"Международный день таможенника России 1952!<br/>";}
if($date=="27.01") { echo"День воинской славы России!<br/>";}
if($date=="29.01") { echo"Китайский новый год!<br/>";}
if($date=="30.01") { echo"Буддийский новый год!<br/>";}
if($date=="31.01") { echo"Новый год по Хиджре!<br/>";}
if($date=="02.02") { echo"День сурка в Канаде и США!<br/>";}
if($date=="05.02") { echo"Нашему сайту 5 лет!<br/>";}  // Можно и так
if($date=="06.02") { echo"Международный день бармена!<br/>";}
if($date=="08.02") { echo"День Российской науки!<br/>";}
if($date=="10.02") { echo"День дипломатического работника России!<br/>";}
if($date=="11.02") { echo"Международный день больного 1992!<br/>";}
if($date=="13.02") { echo"Праздник фонарей Юаньсяо в Китае!<br/>";}
if($date=="14.02") { echo"C днем влюбленных!<br/>";}
if($date=="15.02") { echo"Стерение Господне Христьянский пр.!<br/>";}
if($date=="17.02") { echo"Международный день спонтанного проявления доброты!<br/>";}
if($date=="18.02") { echo"День транспортной милиции России!<br/>";}
if($date=="23.02") { echo"C праздником Мужики $currDate!<br/>";}
if($date=="24.02") { echo"Велесов День!<br/>";}
if($date=="27.02") { echo"Прощеное воскресенье!<br/>";}
if($date=="28.02") { echo"Праздник Дракона в Китае!<br/>";}
if($date=="01.03") { echo"Всемирный день гражданской обороны!<br/>";}
if($date=="03.03") { echo"Международный день писателя!<br/>";}
if($date=="05.03") { echo"День бабушек во Франции!<br/>";}
if($date=="08.03") { echo"Милые дамы с $currDate вас!<br/>";}
if($date=="09.03") { echo"Международный день ди-джея World DJ Day!<br/>";}
if($date=="10.03") { echo"День архивов России!<br/>";}
if($date=="12.03") { echo"День работников уголовно-исполнительной системы Минюста РФ!<br/>";}
if($date=="15.03") { echo"Международный день защиты прав потребителей!<br/>";}
if($date=="17.03") { echo"День боксёра МУАЙ ТАЙ в Тайладе!<br/>";}
if($date=="18.03") { echo"День налоговой полиции России!<br/>";}
if($date=="19.03") { echo"День Моряка-подводника России!<br/>";}
if($date=="20.03") { echo"Международный день франкофонии!<br/>";}
if($date=="21.03") { echo"Международный день поэзии 1999!<br/>";}
if($date=="22.03") { echo"Международный день водных ресурсов 1992!<br/>";}
if($date=="23.03") { echo"Всемирный метеорологический день!<br/>";}
if($date=="24.03") { echo"Всемирный день борьбы с туберкулёзом!<br/>";}
if($date=="27.03") { echo"День внутренних войск МВД РФ!<br/>";}
if($date=="29.03") { echo"День специалиста юридической службы России!<br/>";}
if($date=="01.04") { echo"$currDate никому не верь!<br/>";}
if($date=="02.04") { echo"День геолога России!<br/>";}
if($date=="03.04") { echo"День Водяного!<br/>";}
if($date=="04.04") { echo"День святого Исидора - покровителя ИНТЕРНЕТА!<br/>";}
if($date=="05.04") { echo"День посадки деревьев в Южной Корее!<br/>";}
if($date=="06.04") { echo"День работника следственных органов РФ!<br/>";}
if($date=="07.04") { echo"Международный день здоровья 1948!<br/>";}
if($date=="08.04") { echo"День войск противовоздухной обороны (День ПВО) России!<br/>";}
if($date=="09.04") { echo"День сотрудников военных комиссариатов 1918!<br/>";}
if($date=="10.04") { echo"Рождество Пророка Мухаммеда!<br/>";}
if($date=="12.04") { echo"Всемирный День авиации и космонавтики - Полёт Гагарина 1961!<br/>";}
if($date=="15.04") { echo"День специалиста по радиоэлектронной борьбе России!<br/>";}
if($date=="16.04") { echo"Вербное воскресенье!<br/>";}
if($date=="17.04") { echo"Праздник Богини-Матери в Китае!<br/>";}
if($date=="18.04") { echo"Международный день памятников и исторических мест!<br/>";}
if($date=="19.04") { echo"День подснежника в Великобритании!<br/>";}
if($date=="20.04") { echo"День девушек в Великобритании!<br/>";}
if($date=="21.04") { echo"День основания Рима!<br/>";}
if($date=="22.04") { echo"Международный день Земли!<br/>";}
if($date=="23.04") { echo"День Православная Пасха - Гос.Выходной!<br/>";}
if($date=="24.04") { echo"Международный день солидарности молодёжи 1957!<br/>";}
if($date=="26.04") { echo"Международный день интеллектуальной собственности!<br/>";}
if($date=="28.04") { echo"Международный день охраны труда 2001!<br/>";}
if($date=="29.04") { echo"Международный день танца 1982!<br/>";}
if($date=="30.04") { echo"День пожарной охраны России!<br/>";}
if($date=="01.05") { echo"День весны и труда - Гос.Выходной России!<br/>";}
if($date=="03.05") { echo"Всемирный день свободы печати!<br/>";}
if($date=="04.05") { echo"День отдыха в Японии!<br/>";}
if($date=="05.05") { echo"Международный день Европы!<br/>";}
if($date=="06.05") { echo"Международный день астрономии 1973!<br/>";}
if($date=="07.05") { echo"День радио России!<br/>";}
if($date=="09.05") { echo"День Победы - Гос.Выходной!<br/>";}
if($date=="11.05") { echo"День первой борозды в Тайланде!<br/>";}
if($date=="12.05") { echo"Международный день медицинских сестёр!<br/>";}
if($date=="13.05") { echo"День велосипедиста в Нидерландах!<br/>";}
if($date=="15.05") { echo"Международный день семьи 1993!<br/>";}
if($date=="17.05") { echo"Международный день электросвязи и телекомуникации!<br/>";}
if($date=="18.05") { echo"Международный день музеев!<br/>";}
if($date=="20.05") { echo"Международный день метролога 1875!<br/>";}
if($date=="21.05") { echo"Международный день ЮНЕСКО за культурное развитие 2003!<br/>";}
if($date=="22.05") { echo"Международный день биологического разнообразия!<br/>";}
if($date=="24.05") { echo"День кадровика России 2005!<br/>";}
if($date=="25.05") { echo"День освобождения Африки!<br/>";}
if($date=="27.05") { echo"Всемирный День библиотек!<br/>";}
if($date=="28.05") { echo"День Пограничника и Химика России 1994!<br/>";}
if($date=="29.05") { echo"День военного автомобилиста РФ 2000!<br/>";}
if($date=="31.05") { echo"Международный день отказа от табака 1988!<br/>";}
if($date=="01.06") { echo"Международный день защиты детей!<br/>";}
if($date=="04.06") { echo"День мелиоратора России!<br/>";}
if($date=="05.06") { echo"Международный день охраны окружающей среды 1972!<br/>";}
if($date=="06.06") { echo"Пушкинский День России д.р.1799!<br/>";}
if($date=="08.06") { echo"День социального работника России 2000!<br/>";}
if($date=="09.06") { echo"Международный день друзей!<br/>";}
if($date=="11.06") { echo"День работников легкой промышленности России!<br/>";}
if($date=="12.06") { echo"День РОССИИ - Гос.Выходной!<br/>";}
if($date=="14.06") { echo"Международный день донора крови 2005!<br/>";}
if($date=="15.06") { echo"Зелёные святки!<br/>";}
if($date=="17.06") { echo"Международный день по борьбе с опустыниванием и засухой 1994!<br/>";}
if($date=="18.06") { echo"День медицинского работника России!<br/>";}
if($date=="20.06") { echo"Международный день беженцев!<br/>";}
if($date=="21.06") { echo"День музыки во Франции!<br/>";}
if($date=="22.06") { echo"День памяти и скорби России!<br/>";}
if($date=="23.06") { echo"Иванов день!<br/>";}
if($date=="24.06") { echo"День изобритателя и рационализатора России!<br/>";}
if($date=="25.06") { echo"День дружбы, единения славян!<br/>";}
if($date=="26.06") { echo"Международный день борьби с наркотиками!<br/>";}
if($date=="27.06") { echo"День молодежи России!<br/>";}
if($date=="30.06") { echo"Чествованиие Небес в Китае!<br/>";}
if($date=="01.07") { echo"Международный день кооперативов!<br/>";}
if($date=="02.07") { echo"День работников морского и речного флота РФ!<br/>";}
if($date=="03.07") { echo"День ГАИ-ГИБДД!<br/>";}
if($date=="04.07") { echo"День Будды Медицины у мусульман!<br/>";}
if($date=="05.07") { echo"День Кирилла и Мефодия в Чехии!<br/>";}
if($date=="06.07") { echo"Международный день поцелуев!<br/>";}
if($date=="07.07") { echo"Ивана Купала!<br/>";}
if($date=="09.07") { echo"День российской почты, День рыбака!<br/>";}
if($date=="11.07") { echo"Международный день народонаселения 1989!<br/>";}
if($date=="12.07") { echo"День первоверховных апостолов Пета и Павла!<br/>";}
if($date=="14.07") { echo"День взятия Бастилии во Франции!<br/>";}
if($date=="16.07") { echo"День металлурга России!<br/>";}
if($date=="17.07") { echo"День моря в Японии!<br/>";}
if($date=="18.07") { echo"День обретения мощей Сергея Радонежского!<br/>";}
if($date=="20.07") { echo"Международный день шахмат 1966!<br/>";}
if($date=="23.07") { echo"День работников торговли России!<br/>";}
if($date=="28.07") { echo"День PR-специалиста России 2003!<br/>";}
if($date=="30.07") { echo"День Военно-морского флота России!<br/>";}
if($date=="01.08") { echo"День инкассатора России!<br/>";}
if($date=="02.08") { echo"День десантника России!<br/>";}
if($date=="06.08") { echo"День железнодорожника России!<br/>";}
if($date=="09.08") { echo"День воинской славы России!<br/>";}
if($date=="12.08") { echo"День Военно-воздухных сил России!<br/>";}
if($date=="13.08") { echo"День строителя России 1956!<br/>";}
if($date=="14.08") { echo"Успенский пост!<br/>";}
if($date=="15.08") { echo"Международный день археолога!<br/>";}
if($date=="19.08") { echo"День пасочника на Украине!<br/>";}
if($date=="20.08") { echo"День Воздушного флота России!<br/>";}
if($date=="22.08") { echo"День Государственного флага РФ!<br/>";}
if($date=="23.08") { echo"День воинской славы России!<br/>";}
if($date=="24.08") { echo"Навидадес - празник риса в Индии!<br/>";}
if($date=="27.08") { echo"День Кино, День шахтёра России!<br/>";}
if($date=="28.08") { echo"Успение Пресвятой Богородицы!<br/>";}
if($date=="01.09") { echo"День знаний России!<br/>";}
if($date=="02.09") { echo"День Российской гвардии!<br/>";}
if($date=="03.09") { echo"День работников нефтяной, газовой и топливной промышленности России!<br/>";}
if($date=="04.09") { echo"День специалиста по ядерному обеспечению России 2006!<br/>";}
if($date=="08.09") { echo"Международный день грамотности!<br/>";}
if($date=="09.09") { echo"День тестировщика России 1945!<br/>";}
if($date=="10.09") { echo"День танкиста России!<br/>";}
if($date=="11.09") { echo"День воинской славы России!<br/>";}
if($date=="13.09") { echo"Международный день программаста - 256 дней!<br/>";}
if($date=="15.09") { echo"День секретаря России!<br/>";}
if($date=="16.09") { echo"Международный день охраны озонового слоя!<br/>";}
if($date=="17.09") { echo"День работников леса России!<br/>";}
if($date=="20.09") { echo"Профессиональный праздник таможенника!<br/>";}
if($date=="21.09") { echo"День воинской славы России!<br/>";}
if($date=="23.09") { echo"День осеннего равновесия в Японии!<br/>";}
if($date=="24.09") { echo"День машиностроителя России!<br/>";}
if($date=="26.09") { echo"Европейский день иностранных языков!<br/>";}
if($date=="27.09") { echo"День воспитателя России!<br/>";}
if($date=="28.09") { echo"День работников атомной промышленности России!<br/>";}
if($date=="30.09") { echo"День ИНТЕРНЕТА в России!<br/>";}
if($date=="01.10") { echo"Международный день пожилых людей, День сухопутных войск!<br/>";}
if($date=="02.10") { echo"Международный день врача и архитектора!<br/>";}
if($date=="04.10") { echo"День космических войск России!<br/>";}
if($date=="05.10") { echo"День учителя России 1994!<br/>";}
if($date=="06.10") { echo"День российского страховщика 1921!<br/>";}
if($date=="08.10") { echo"День работников сельского хоз-ва и перераб. пром-ти 1999!<br/>";}
if($date=="09.10") { echo"Всемирный день почты!<br/>";}
if($date=="10.10") { echo"Всемирный день психического здоровья!<br/>";}
if($date=="12.10") { echo"День кадрового работника России!<br/>";}
if($date=="13.10") { echo"Пятница 13-го!<br/>";}
if($date=="14.10") { echo"Международный день стандартизации 1946!<br/>";}
if($date=="15.10") { echo"День работников пищевой промышленности России!<br/>";}
if($date=="16.10") { echo"Международный день Шефа 1958!<br/>";}
if($date=="17.10") { echo"Международный день борьбы за ликвидацию нищеты!<br/>";}
if($date=="18.10") { echo"День Рогатого Бога Британии!<br/>";}
if($date=="20.10") { echo"День рождения Российского военно-морского флота 1696, День воен. связиста 1919!<br/>";}
if($date=="21.10") { echo"Праздник урожая в Индии!<br/>";}
if($date=="23.10") { echo"День рекламиста России!<br/>";}
if($date=="24.10") { echo"День подраздиления специального назначения России 1950!<br/>";}
if($date=="25.10") { echo"День таможенника России!<br/>";}
if($date=="28.10") { echo"День армеской авиации России 1948!<br/>";}
if($date=="29.10") { echo"День автомобилиста России 1996!<br/>";}
if($date=="30.10") { echo"День инженера-механика, День памяти полит. репрессий!<br/>";}
if($date=="31.10") { echo"День сурдопереводчика России 2003!<br/>";}
if($date=="01.11") { echo"день народных будителей России!<br/>";}
if($date=="04.11") { echo"День народного единства Гос.Выходной России!<br/>";}
if($date=="05.11") { echo"День военного разведчика России!<br/>";}
if($date=="06.11") { echo"День судебного пристава России!<br/>";}
if($date=="08.11") { echo"Международный день КВН!<br/>";}
if($date=="09.11") { echo"Всемирный день качества!<br/>";}
if($date=="10.11") { echo"День милиции России!<br/>";}
if($date=="12.11") { echo"День специалиста по безопасности России!<br/>";}
if($date=="13.11") { echo"День войск радиационной, химической, и биологической защиты России!<br/>";}
if($date=="14.11") { echo"День социолога России!<br/>";}
if($date=="15.11") { echo"Всероссийский день призывника 1992!<br/>";}
if($date=="16.11") { echo"Международный день терпимости 1996!<br/>";}
if($date=="17.11") { echo"День участкового России 1923!<br/>";}
if($date=="18.11") { echo"День рождения Деда Мороза!<br/>";}
if($date=="19.11") { echo"День ракетых войск и артиллерии России 1942!<br/>";}
if($date=="20.11") { echo"Международный день ребёнка 1959!<br/>";}
if($date=="21.11") { echo"День бухгалтера, День работников налоговой органов РФ!<br/>";}
if($date=="24.11") { echo"День завоевания друзей в США!<br/>";}
if($date=="25.11") { echo"Международный день борьбы за ликвидацию насилия в отношении женщин!<br/>";}
if($date=="26.11") { echo"День матери России!<br/>";}
if($date=="27.11") { echo"День морской пехоты России 1995!<br/>";}
if($date=="30.11") { echo"Международный день защиты информации 1988!<br/>";}
if($date=="01.12") { echo"День воинской славы России!<br/>";}
if($date=="02.12") { echo"День банковского работника России!<br/>";}
if($date=="03.12") { echo"Международный день инвалидов 1992!<br/>";}
if($date=="04.12") { echo"День информатики России 1948!<br/>";}
if($date=="05.12") { echo"День воинской славы России!<br/>";}
if($date=="07.12") { echo"Международный день гражданской авиации 1996!<br/>";}
if($date=="09.12") { echo"Международный день борьбы с коррупцией 2003!<br/>";}
if($date=="10.12") { echo"Международный день прав человека!<br/>";}
if($date=="11.12") { echo"Международный день гор!<br/>";}
if($date=="12.12") { echo"День Конституции Российской Федерации 1993!<br/>";}
if($date=="16.12") { echo"День риэлтора России!<br/>";}
if($date=="17.12") { echo"День ракетных войск стратегического назначения России 1959!<br/>";}
if($date=="18.12") { echo"Международный день мигранта!<br/>";}
if($date=="19.12") { echo"Международный день помощи бедным!<br/>";}
if($date=="20.12") { echo"День работников органов государтвенной безопасности РФ - День ФСБ!<br/>";}
if($date=="22.12") { echo"День энергетика России 1966!<br/>";}
if($date=="23.12") { echo"День дальней авиации ВВС России!<br/>";}
if($date=="24.12") { echo"День воинской славы России 1790!<br/>";}
if($date=="25.12") { echo"Коляда!<br/>";}
if($date=="26.12") { echo"Международный день подарков!<br/>";}
if($date=="27.12") { echo"День спасателя Российской Федерации!<br/>";}
if($date=="31.12") { echo"C Новым годом!<br/>";}
?>