<?
include "../configs.php";
include "../style/verh_reg.php";
echo'<div class="bordur">Правила сайта</div>';
echo '<div class="menu">';
echo '1. Запрещена нецензурная лексика на всех модулях сайта. Правило распространяется и на те случаи, когда одна или несколько букв в таком слове заменены точками или другими знаками.<br />
2. Запрещён флейм на всех модулях сайта, кроме предназначенных для этого (таких как раздел "Флейм" на форуме, если он есть, или чат).<br />
3. Запрещено создание тем с просьбами о займе денег.<br />
4. Запрещена реклама сторонних wap и web ресурсов на всех модулях сайта. Рекламой считается любой URL, не являющийся прямой ссылкой на файл. Подпись к ссылке "не реклама" расценивается как неуважение к администрации. Разрешается давать ссылку на страницу закачки данного (одного!) файла, но только если по техническим причинам нет возможности дать прямую ссылку. Свою личную страничку вы можете указать в вашей анкете.<br />
5. Запрещается выкладывать файлы сомнительного содержания, к которым относятся вирусы, трояны и приложения, автоматически отправляющие платные SMS.<br />
6. Запрещена реклама с целью личного обогащения или обмана пользователей ("бесплатный" GPRS и тому подобное мошенничество).<br />
7. Запрещается обсуждение администраторов, модераторов и их действий публично. Все претензии принимаются через личные сообщения.<br />
8. Запрещено намеренное клонирование ников других посетителей сайта. Имеется в виду регистрация под ником, схожим по написанию или звучанию с ником другого пользователя (особенно модератора или администратора), для намеренного введения в заблуждение пользователей сайта. Также запрещено регистрироваться под никами, которые могут ввести в заблуждение новичков сайта, например "Модератор", "Админ" и т.п.<br />
9. Запрещено регистрировать ники откровенно сексуального характера, неприличные, нарушающие общепринятые нормы морали, оскорбляющие отдельных пользователей или группы пользователей (по национальному, религиозному или иному признаку).<br />
10. Запрещены оскорбления, особенно этнического, политического, расового и религиозного характера на всех модулях сайта.<br />
11. Запрещено размещать на любом из модулей сайта файлы и ссылки на видео и изображения с убийствами, казнями и т.п., а также с детской порнографией.<br />
12. Запрещены призывы к нарушению законодательства РФ, а также сообщения, сами по себе нарушающие законодательство РФ.<br />
<b>Если модератор ради исключения не наказал вас за нарушение, не воспринимайте это как должное. Претензии типа "А раньше вы за это не наказывали" и "Других вы за это не наказали" не принимаются. Отвечайте только за свои действия.</b>
Запрещено выяснять отношения с администрацией сайта или с другими пользователями "в эфире" (кроме специально отведённых для этого мест).
<b>Администрация сайта имеет право изменять данные правила без предупреждения.</b><br>
<a href="reg.php">Продолжить</a></div>';

include'../style/niz.php';
?>
